app/Services/BlogsService.php

SELECT *
FROM `blog`
WHERE `blog`.`deleted_at` IS NULL
---
    public function getAllBlogs()
    {
        return $this->blogs->findAll();