app/Services/ProductsService.php

SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL
---
    public function getAllProduct()
    {
        return $this->product->findAll();

SELECT *
FROM `products`
WHERE `id_product` = '53'
AND `products`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getProductByID($idProduct)
    {
        return $this->product->where('id', $idProduct)->first();