app/Controllers/Admin/BlogControllers.php

SELECT *
FROM `blog`
---
    public function add(){
        $data = [];
        $blogs = new BlogModel();
        $data['blogs'] = $blogs->findAll();