app/Controllers/Admin/LoginControllers.php

    public function login()
    {
        $session = session();
        $model = new UserModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $data = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'dduong1703@gmail.com'
 LIMIT 1