app/Controllers/Admin/ProductControllers.php

    public function add()
    {
        $data = [];
        $products = new ProductModel();
        $data['products'] = $products->findAll();
---
SELECT *
FROM `products`

    public function create()
    {
        $result = $this->service->addProductsInfo($this->request);
        return redirect()->back()->withInput()->with($result['massageCode'], $result['messages']);
---
SELECT *
FROM `products`