app/Controllers/Users/HomeControllers.php

    public function index(): string
    {
        $productModel = new ProductModel();
        $allParam = $productModel->findAll();
        $products = [];
        $data['cateObj'] = $allParam;
        $data['recommendedProducts'] = $productModel->findAll();
---
SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL

    public function product($category = null)
    {
        $productModel = new ProductModel();
        $data = [];
        if ($category) {
            // Nếu có danh mục được chọn, lọc sản phẩm theo danh mục
            $data['products'] = $productModel->where('category', $category)->paginate(12);

        } else {
            // Nếu không có danh mục được chọn, hiển thị tất cả sản phẩm
            $data['products'] = $productModel->paginate(12);
---
SELECT *
FROM `products`
WHERE `category` = 'LAPTOP'
AND `products`.`deleted_at` IS NULL
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `category` = 'LAPTOP'
AND `products`.`deleted_at` IS NULL
SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL
 LIMIT 36, 12
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `products`.`deleted_at` IS NULL