app/Controllers/Users/HomeControllers.php

SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `products`.`deleted_at` IS NULL
---
    public function product(){
        $productModel = new ProductModel();
//        $product = $productModel->paginate(10);
//        if($product == null){
//            return false;
//        }
        $data['products'] = $productModel->paginate(12);