app/Controllers/Users/ProductsController.php

SELECT *
FROM `products`
WHERE `products`.`deleted_at` IS NULL
AND `products`.`id` = '9'
---
    public function detail($productId)
    {
        $productModel = new ProductModel();
        $productId  = $productModel->find($productId);